import { IBaseResponseData, ICardWidget } from "@models";

import { IFullTableItem, IPlanFactById, IPlanFactChartItem, IPlanFactGeneralInfo, IPlanFactItem } from "./plan-fact.model";

export const PLAN_FACT_LIST: IPlanFactItem[] = [
  {
    "id": 1110,
    "created_at": "22.02.2026",
    "created_at_full": "2026-02-22 18:39:02",
    "plan_name": "1111",
    "start_date": "01.02.2026",
    "days": 28,
    "type": "По сумме заказов",
    "method": "По артикулам",
    "goal_rub": 250000,
    "monthFrom": "02",
    "yearFrom": "2026",
    "dateFrom": "февр. 2026",
    "status": "Активен"
  }
]

export const PLAN_FACT_CARDS: ICardWidget[] = [
  {
    "title": "По спланированным артикулам",
    "subfields": [
      {
        "name": "Количество артикулов в плане",
        "value": 5,
        "unit": "count",
        "diffInPercents": null,
        "description": null
      },
      {
        "name": "Заказов по артикулам",
        "value": 19086,
        "unit": "rubles",
        "diffInPercents": null,
        "description": null
      },
      {
        "name": "Продаж по артикулам",
        "value": 7587,
        "unit": "rubles",
        "diffInPercents": null,
        "description": null
      }
    ],
    "totalCount": null,
    "totalSum": null,
    "diffInPercents": null,
    "description": null
  },
  {
    "title": "По всему кабинету",
    "subfields": [
      {
        "name": "Количество артикулов по кабинету",
        "value": "14",
        "unit": "count",
        "diffInPercents": null,
        "description": null
      },
      {
        "name": "Заказов по кабинету",
        "value": 2029796,
        "unit": "rubles",
        "diffInPercents": null,
        "description": null
      },
      {
        "name": "Продаж по кабинету",
        "value": 1412638,
        "unit": "rubles",
        "diffInPercents": null,
        "description": null
      }
    ],
    "totalCount": null,
    "totalSum": null,
    "diffInPercents": null,
    "description": null
  }
] as ICardWidget[]

export const PLAN_FACT_GENERAL_INFO: IPlanFactGeneralInfo = {
    "id": 1110,
    "created_at": "2026-02-22",
    "plan_name": "1111",
    "start_date": "2026-02-01",
    "Ym": "2026-02",
    "days": 28,
    "type": 1,
    "method": 2,
    "goal_rub": "250000",
    "been_days": 22,
    "left_days": 6,
    "table": {
        "plan": {
            "sum_day": 8929,
            "sum_today": 196429,
            "sum_rub": 250000
        },
        "fact": {
            "sum_day": 868,
            "sum_today": 19086,
            "sum_rub": 24291
        },
        "delta_rub": {
            "sum_day": -8061,
            "sum_today": -177343,
            "sum_rub": -225709
        },
        "delta_percent": {
            "sum_day": -90.28,
            "sum_today": -90.28,
            "sum_rub": -90.28
        }
    }
}

export const PLAN_FACT_CHART: IPlanFactChartItem[] = [
    {
        "ordersCount": "1",
        "cancelsCount": "1",
        "ordersTotal": 1350,
        "cancelsTotal": 1350,
        "salesCount": null,
        "returnsCount": null,
        "salesTotal": null,
        "returnsTotal": null,
        "date": "01.02.2026"
    },
    {
        "ordersCount": "1",
        "cancelsCount": "0",
        "ordersTotal": 1350,
        "cancelsTotal": 0,
        "salesCount": null,
        "returnsCount": null,
        "salesTotal": null,
        "returnsTotal": null,
        "date": "03.02.2026"
    },
    {
        "ordersCount": "1",
        "cancelsCount": "1",
        "ordersTotal": 1350,
        "cancelsTotal": 1350,
        "salesCount": null,
        "returnsCount": null,
        "salesTotal": null,
        "returnsTotal": null,
        "date": "04.02.2026"
    },
    {
        "ordersCount": null,
        "cancelsCount": null,
        "ordersTotal": null,
        "cancelsTotal": null,
        "salesCount": "1",
        "returnsCount": "0",
        "salesTotal": 1350,
        "returnsTotal": 0,
        "date": "10.02.2026"
    },
    {
        "ordersCount": "1",
        "cancelsCount": "1",
        "ordersTotal": 1260,
        "cancelsTotal": 1260,
        "salesCount": null,
        "returnsCount": null,
        "salesTotal": null,
        "returnsTotal": null,
        "date": "11.02.2026"
    },
    {
        "ordersCount": "1",
        "cancelsCount": "0",
        "ordersTotal": 1260,
        "cancelsTotal": 0,
        "salesCount": null,
        "returnsCount": null,
        "salesTotal": null,
        "returnsTotal": null,
        "date": "14.02.2026"
    },
    {
        "ordersCount": "2",
        "cancelsCount": "2",
        "ordersTotal": 2520,
        "cancelsTotal": 2520,
        "salesCount": null,
        "returnsCount": null,
        "salesTotal": null,
        "returnsTotal": null,
        "date": "15.02.2026"
    },
    {
        "ordersCount": null,
        "cancelsCount": null,
        "ordersTotal": null,
        "cancelsTotal": null,
        "salesCount": "1",
        "returnsCount": "0",
        "salesTotal": 1260,
        "returnsTotal": 0,
        "date": "17.02.2026"
    },
    {
        "ordersCount": "3",
        "cancelsCount": "2",
        "ordersTotal": 3780,
        "cancelsTotal": 2520,
        "salesCount": null,
        "returnsCount": null,
        "salesTotal": null,
        "returnsTotal": null,
        "date": "18.02.2026"
    },
    {
        "ordersCount": "2",
        "cancelsCount": "0",
        "ordersTotal": 2479,
        "cancelsTotal": 0,
        "salesCount": null,
        "returnsCount": null,
        "salesTotal": null,
        "returnsTotal": null,
        "date": "19.02.2026"
    },
    {
        "ordersCount": "1",
        "cancelsCount": "0",
        "ordersTotal": 1240,
        "cancelsTotal": 0,
        "salesCount": null,
        "returnsCount": null,
        "salesTotal": null,
        "returnsTotal": null,
        "date": "20.02.2026"
    },
    {
        "ordersCount": "1",
        "cancelsCount": "0",
        "ordersTotal": 1240,
        "cancelsTotal": 0,
        "salesCount": "2",
        "returnsCount": "0",
        "salesTotal": 2499,
        "returnsTotal": 0,
        "date": "21.02.2026"
    },
    {
        "ordersCount": "1",
        "cancelsCount": "0",
        "ordersTotal": 1260,
        "cancelsTotal": 0,
        "salesCount": "2",
        "returnsCount": "0",
        "salesTotal": 2478,
        "returnsTotal": 0,
        "date": "22.02.2026"
    }
]

export const PLAN_FACT_FULLTABLE: IFullTableItem[] = [
  {
    "level": 1,
    "expanded": false,
    "type": "Заказы, руб",
    "total": 19086,
    "plan_day": 8928.57142857143,
    "01.02.2026": {
      "value": 1350,
      "deltaInRubles": -7578.571428571429,
      "deltaInPercent": -84.88000000000001
    },
    "02.02.2026": {
      "value": 0,
      "deltaInRubles": -8928.57142857143,
      "deltaInPercent": -100
    },
    "03.02.2026": {
      "value": 1350,
      "deltaInRubles": -7578.571428571429,
      "deltaInPercent": -84.88000000000001
    },
    "04.02.2026": {
      "value": 1350,
      "deltaInRubles": -7578.571428571429,
      "deltaInPercent": -84.88000000000001
    },
    "05.02.2026": {
      "value": 0,
      "deltaInRubles": -8928.57142857143,
      "deltaInPercent": -100
    },
    "06.02.2026": {
      "value": 0,
      "deltaInRubles": -8928.57142857143,
      "deltaInPercent": -100
    },
    "07.02.2026": {
      "value": 0,
      "deltaInRubles": -8928.57142857143,
      "deltaInPercent": -100
    },
    "08.02.2026": {
      "value": 0,
      "deltaInRubles": -8928.57142857143,
      "deltaInPercent": -100
    },
    "09.02.2026": {
      "value": 0,
      "deltaInRubles": -8928.57142857143,
      "deltaInPercent": -100
    },
    "10.02.2026": {
      "value": 0,
      "deltaInRubles": -8928.57142857143,
      "deltaInPercent": -100
    },
    "11.02.2026": {
      "value": 1260,
      "deltaInRubles": -7668.571428571429,
      "deltaInPercent": -85.888
    },
    "12.02.2026": {
      "value": 0,
      "deltaInRubles": -8928.57142857143,
      "deltaInPercent": -100
    },
    "13.02.2026": {
      "value": 0,
      "deltaInRubles": -8928.57142857143,
      "deltaInPercent": -100
    },
    "14.02.2026": {
      "value": 1260,
      "deltaInRubles": -7668.571428571429,
      "deltaInPercent": -85.888
    },
    "15.02.2026": {
      "value": 2520,
      "deltaInRubles": -6408.571428571429,
      "deltaInPercent": -71.77600000000001
    },
    "16.02.2026": {
      "value": 0,
      "deltaInRubles": -8928.57142857143,
      "deltaInPercent": -100
    },
    "17.02.2026": {
      "value": 0,
      "deltaInRubles": -8928.57142857143,
      "deltaInPercent": -100
    },
    "18.02.2026": {
      "value": 3780,
      "deltaInRubles": -5148.571428571429,
      "deltaInPercent": -57.66400000000001
    },
    "19.02.2026": {
      "value": 2478.0000000000005,
      "deltaInRubles": -6450.571428571429,
      "deltaInPercent": -72.24640000000001
    },
    "20.02.2026": {
      "value": 1239.0000000000002,
      "deltaInRubles": -7689.571428571429,
      "deltaInPercent": -86.1232
    },
    "21.02.2026": {
      "value": 1239.0000000000002,
      "deltaInRubles": -7689.571428571429,
      "deltaInPercent": -86.1232
    },
    "22.02.2026": {
      "value": 1260,
      "deltaInRubles": -7668.571428571429,
      "deltaInPercent": -85.888
    },
    "articles": [
      {
        "type": "стразыСумка-сер001",
        "total": 14130,
        "plan_day": 1785.7142857142858,
        "01.02.2026": {
          "value": 1350,
          "deltaInRubles": -435.7142857142858,
          "deltaInPercent": -24.400000000000002
        },
        "02.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "03.02.2026": {
          "value": 1350,
          "deltaInRubles": -435.7142857142858,
          "deltaInPercent": -24.400000000000002
        },
        "04.02.2026": {
          "value": 1350,
          "deltaInRubles": -435.7142857142858,
          "deltaInPercent": -24.400000000000002
        },
        "05.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "06.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "07.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "08.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "09.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "10.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "11.02.2026": {
          "value": 1260,
          "deltaInRubles": -525.7142857142858,
          "deltaInPercent": -29.440000000000005
        },
        "12.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "13.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "14.02.2026": {
          "value": 1260,
          "deltaInRubles": -525.7142857142858,
          "deltaInPercent": -29.440000000000005
        },
        "15.02.2026": {
          "value": 2520,
          "deltaInRubles": 734.2857142857142,
          "deltaInPercent": 41.11999999999999
        },
        "16.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "17.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "18.02.2026": {
          "value": 3780,
          "deltaInRubles": 1994.2857142857142,
          "deltaInPercent": 111.67999999999999
        },
        "19.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "20.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "21.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "22.02.2026": {
          "value": 1260,
          "deltaInRubles": -525.7142857142858,
          "deltaInPercent": -29.440000000000005
        }
      },
      {
        "type": "стразыСумка-чер001",
        "total": 4956.000000000001,
        "plan_day": 1785.7142857142858,
        "01.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "02.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "03.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "04.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "05.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "06.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "07.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "08.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "09.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "10.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "11.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "12.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "13.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "14.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "15.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "16.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "17.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "18.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "19.02.2026": {
          "value": 2478.0000000000005,
          "deltaInRubles": 692.2857142857147,
          "deltaInPercent": 38.768000000000015
        },
        "20.02.2026": {
          "value": 1239.0000000000002,
          "deltaInRubles": -546.7142857142856,
          "deltaInPercent": -30.615999999999993
        },
        "21.02.2026": {
          "value": 1239.0000000000002,
          "deltaInRubles": -546.7142857142856,
          "deltaInPercent": -30.615999999999993
        },
        "22.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        }
      },
      {
        "type": "Сум00152white-001",
        "total": 0,
        "plan_day": 1785.7142857142858,
        "01.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "02.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "03.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "04.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "05.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "06.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "07.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "08.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "09.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "10.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "11.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "12.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "13.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "14.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "15.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "16.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "17.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "18.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "19.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "20.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "21.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "22.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        }
      },
      {
        "type": "Сум00152brown-001",
        "total": 0,
        "plan_day": 1785.7142857142858,
        "01.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "02.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "03.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "04.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "05.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "06.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "07.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "08.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "09.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "10.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "11.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "12.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "13.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "14.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "15.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "16.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "17.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "18.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "19.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "20.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "21.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "22.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        }
      },
      {
        "type": "Сум00152black-001",
        "total": 0,
        "plan_day": 1785.7142857142858,
        "01.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "02.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "03.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "04.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "05.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "06.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "07.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "08.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "09.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "10.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "11.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "12.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "13.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "14.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "15.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "16.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "17.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "18.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "19.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "20.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "21.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        },
        "22.02.2026": {
          "value": 0,
          "deltaInRubles": -1785.7142857142858,
          "deltaInPercent": -100
        }
      }
    ]
  },
  {
    "level": 1,
    "expanded": false,
    "type": "Заказы, шт",
    "total": 15,
    "plan_day": null,
    "01.02.2026": 1,
    "02.02.2026": 0,
    "03.02.2026": 1,
    "04.02.2026": 1,
    "05.02.2026": 0,
    "06.02.2026": 0,
    "07.02.2026": 0,
    "08.02.2026": 0,
    "09.02.2026": 0,
    "10.02.2026": 0,
    "11.02.2026": 1,
    "12.02.2026": 0,
    "13.02.2026": 0,
    "14.02.2026": 1,
    "15.02.2026": 2,
    "16.02.2026": 0,
    "17.02.2026": 0,
    "18.02.2026": 3,
    "19.02.2026": 2,
    "20.02.2026": 1,
    "21.02.2026": 1,
    "22.02.2026": 1,
    "articles": [
      {
        "type": "стразыСумка-сер001",
        "total": 11,
        "plan_day": null,
        "01.02.2026": "1",
        "02.02.2026": 0,
        "03.02.2026": "1",
        "04.02.2026": "1",
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": "0",
        "11.02.2026": "1",
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": "1",
        "15.02.2026": "2",
        "16.02.2026": 0,
        "17.02.2026": "0",
        "18.02.2026": "3",
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": "0",
        "22.02.2026": "1"
      },
      {
        "type": "стразыСумка-чер001",
        "total": 4,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": "2",
        "20.02.2026": "1",
        "21.02.2026": "1",
        "22.02.2026": "0"
      },
      {
        "type": "Сум00152white-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      },
      {
        "type": "Сум00152brown-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      },
      {
        "type": "Сум00152black-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      }
    ]
  },
  {
    "level": 1,
    "expanded": false,
    "type": "Ср. цена заказа, руб",
    "total": 639.4090909090909,
    "plan_day": null,
    "01.02.2026": 1350,
    "02.02.2026": 0,
    "03.02.2026": 1350,
    "04.02.2026": 1350,
    "05.02.2026": 0,
    "06.02.2026": 0,
    "07.02.2026": 0,
    "08.02.2026": 0,
    "09.02.2026": 0,
    "10.02.2026": 0,
    "11.02.2026": 1260,
    "12.02.2026": 0,
    "13.02.2026": 0,
    "14.02.2026": 1260,
    "15.02.2026": 1260,
    "16.02.2026": 0,
    "17.02.2026": 0,
    "18.02.2026": 1260,
    "19.02.2026": 1239.0000000000002,
    "20.02.2026": 1239.0000000000002,
    "21.02.2026": 1239.0000000000002,
    "22.02.2026": 1260,
    "articles": [
      {
        "type": "стразыСумка-сер001",
        "total": 470.45454545454544,
        "plan_day": null,
        "01.02.2026": 1350,
        "02.02.2026": 0,
        "03.02.2026": 1350,
        "04.02.2026": 1350,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 1260,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 1260,
        "15.02.2026": 1260,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 1260,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 1260
      },
      {
        "type": "стразыСумка-чер001",
        "total": 168.9545454545455,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 1239.0000000000002,
        "20.02.2026": 1239.0000000000002,
        "21.02.2026": 1239.0000000000002,
        "22.02.2026": 0
      },
      {
        "type": "Сум00152white-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      },
      {
        "type": "Сум00152brown-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      },
      {
        "type": "Сум00152black-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      }
    ]
  },
  {
    "level": 1,
    "expanded": false,
    "type": "Продажи, руб",
    "total": 7587,
    "plan_day": null,
    "01.02.2026": 0,
    "02.02.2026": 0,
    "03.02.2026": 0,
    "04.02.2026": 0,
    "05.02.2026": 0,
    "06.02.2026": 0,
    "07.02.2026": 0,
    "08.02.2026": 0,
    "09.02.2026": 0,
    "10.02.2026": 1350,
    "11.02.2026": 0,
    "12.02.2026": 0,
    "13.02.2026": 0,
    "14.02.2026": 0,
    "15.02.2026": 0,
    "16.02.2026": 0,
    "17.02.2026": 1260,
    "18.02.2026": 0,
    "19.02.2026": 0,
    "20.02.2026": 0,
    "21.02.2026": 2499,
    "22.02.2026": 2478,
    "articles": [
      {
        "type": "стразыСумка-сер001",
        "total": 3870,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 1350,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 1260,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 1260,
        "22.02.2026": 0
      },
      {
        "type": "стразыСумка-чер001",
        "total": 3717,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 1239,
        "22.02.2026": 2478
      },
      {
        "type": "Сум00152white-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      },
      {
        "type": "Сум00152brown-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      },
      {
        "type": "Сум00152black-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      }
    ]
  },
  {
    "level": 1,
    "expanded": false,
    "type": "Продажи, шт",
    "total": 6,
    "plan_day": null,
    "01.02.2026": 0,
    "02.02.2026": 0,
    "03.02.2026": 0,
    "04.02.2026": 0,
    "05.02.2026": 0,
    "06.02.2026": 0,
    "07.02.2026": 0,
    "08.02.2026": 0,
    "09.02.2026": 0,
    "10.02.2026": 1,
    "11.02.2026": 0,
    "12.02.2026": 0,
    "13.02.2026": 0,
    "14.02.2026": 0,
    "15.02.2026": 0,
    "16.02.2026": 0,
    "17.02.2026": 1,
    "18.02.2026": 0,
    "19.02.2026": 0,
    "20.02.2026": 0,
    "21.02.2026": 2,
    "22.02.2026": 2,
    "articles": [
      {
        "type": "стразыСумка-сер001",
        "total": 3,
        "plan_day": null,
        "01.02.2026": "0",
        "02.02.2026": 0,
        "03.02.2026": "0",
        "04.02.2026": "0",
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": "1",
        "11.02.2026": "0",
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": "0",
        "15.02.2026": "0",
        "16.02.2026": 0,
        "17.02.2026": "1",
        "18.02.2026": "0",
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": "1",
        "22.02.2026": "0"
      },
      {
        "type": "стразыСумка-чер001",
        "total": 3,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": "0",
        "20.02.2026": "0",
        "21.02.2026": "1",
        "22.02.2026": "2"
      },
      {
        "type": "Сум00152white-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      },
      {
        "type": "Сум00152brown-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      },
      {
        "type": "Сум00152black-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      }
    ]
  },
  {
    "level": 1,
    "expanded": false,
    "type": "Ср. цена продажи, руб",
    "total": 288.54545454545456,
    "plan_day": null,
    "01.02.2026": 0,
    "02.02.2026": 0,
    "03.02.2026": 0,
    "04.02.2026": 0,
    "05.02.2026": 0,
    "06.02.2026": 0,
    "07.02.2026": 0,
    "08.02.2026": 0,
    "09.02.2026": 0,
    "10.02.2026": 1350,
    "11.02.2026": 0,
    "12.02.2026": 0,
    "13.02.2026": 0,
    "14.02.2026": 0,
    "15.02.2026": 0,
    "16.02.2026": 0,
    "17.02.2026": 1260,
    "18.02.2026": 0,
    "19.02.2026": 0,
    "20.02.2026": 0,
    "21.02.2026": 2499,
    "22.02.2026": 1239,
    "articles": [
      {
        "type": "стразыСумка-сер001",
        "total": 175.9090909090909,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 1350,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 1260,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 1260,
        "22.02.2026": 0
      },
      {
        "type": "стразыСумка-чер001",
        "total": 112.63636363636364,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 1239,
        "22.02.2026": 1239
      },
      {
        "type": "Сум00152white-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      },
      {
        "type": "Сум00152brown-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      },
      {
        "type": "Сум00152black-001",
        "total": 0,
        "plan_day": null,
        "01.02.2026": 0,
        "02.02.2026": 0,
        "03.02.2026": 0,
        "04.02.2026": 0,
        "05.02.2026": 0,
        "06.02.2026": 0,
        "07.02.2026": 0,
        "08.02.2026": 0,
        "09.02.2026": 0,
        "10.02.2026": 0,
        "11.02.2026": 0,
        "12.02.2026": 0,
        "13.02.2026": 0,
        "14.02.2026": 0,
        "15.02.2026": 0,
        "16.02.2026": 0,
        "17.02.2026": 0,
        "18.02.2026": 0,
        "19.02.2026": 0,
        "20.02.2026": 0,
        "21.02.2026": 0,
        "22.02.2026": 0
      }
    ]
  }
]

export const PLAN_FACT_BY_ID: IPlanFactById = {
    "id": 1110,
    "plan_name": "1111",
    "start_date": "2026-02-01 00:00:00",
    "type": 1,
    "method": 2,
    "goal_rub": null,
    "monthFrom": "02",
    "yearFrom": "2026",
    "dateFrom": "февр. 2026",
    "articles": [
        {
            "isChecked": 1,
            "SKU": "стразыСумка-чер001",
            "plan_sum": 50000,
            "nmid": "115354631",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 1,
            "SKU": "Сум00152white-001",
            "plan_sum": 50000,
            "nmid": "115560092",
            "subject": "Сумки",
            "category": "",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 1,
            "SKU": "Сум00152brown-001",
            "plan_sum": 50000,
            "nmid": "115560093",
            "subject": "Сумки",
            "category": "",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 1,
            "SKU": "Сум00152black-001",
            "plan_sum": 50000,
            "nmid": "115560094",
            "subject": "Сумки",
            "category": "",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 1,
            "SKU": "стразыСумка-сер001",
            "plan_sum": 50000,
            "nmid": "115354630",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "fort-pink",
            "plan_sum": 0,
            "nmid": "177945976",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "blackfull1",
            "plan_sum": 0,
            "nmid": "570248243",
            "subject": "Сумки",
            "category": null,
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "new-print-black",
            "plan_sum": 0,
            "nmid": "178041745",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "new-print-white",
            "plan_sum": 0,
            "nmid": "178041875",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "strazi-knopka",
            "plan_sum": 0,
            "nmid": "178043359",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "strazi-new1",
            "plan_sum": 0,
            "nmid": "178045042",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "strazi-new2",
            "plan_sum": 0,
            "nmid": "178045043",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "puh-high-black",
            "plan_sum": 0,
            "nmid": "179542181",
            "subject": "Пуховики",
            "category": "Одежда",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "puh-high-izum",
            "plan_sum": 0,
            "nmid": "179545522",
            "subject": "Пуховики",
            "category": "Одежда",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "puh-high-graf",
            "plan_sum": 0,
            "nmid": "179545524",
            "subject": "Пуховики",
            "category": "Одежда",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "puh-high-besh",
            "plan_sum": 0,
            "nmid": "179545525",
            "subject": "Пуховики",
            "category": "Одежда",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Puh-mid-beshsvet",
            "plan_sum": 0,
            "nmid": "179547207",
            "subject": "Пуховики",
            "category": "Одежда",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Puh-mid-beshtem",
            "plan_sum": 0,
            "nmid": "179548115",
            "subject": "Пуховики",
            "category": "Одежда",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Puh-mid-black",
            "plan_sum": 0,
            "nmid": "179548187",
            "subject": "Пуховики",
            "category": "Одежда",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "tochilka-blue",
            "plan_sum": 0,
            "nmid": "316378184",
            "subject": "Точилки для ножей",
            "category": "Посуда и инвентарь",
            "category_pnl": null,
            "brand": "soultech",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "mixxyn-white",
            "plan_sum": 0,
            "nmid": "164411829",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "tochilka-ruch",
            "plan_sum": 0,
            "nmid": "432026895",
            "subject": "Точилки для ножей",
            "category": "Посуда и инвентарь",
            "category_pnl": null,
            "brand": "soultech",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "tochilka-ruchn1",
            "plan_sum": 0,
            "nmid": "442964834",
            "subject": "Точилки для ножей",
            "category": "Посуда и инвентарь",
            "category_pnl": null,
            "brand": "soultech",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "tochilka-black",
            "plan_sum": 0,
            "nmid": "443889078",
            "subject": "Точилки для ножей",
            "category": "Посуда и инвентарь",
            "category_pnl": null,
            "brand": "soultech",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "tochilka-ruchn2",
            "plan_sum": 0,
            "nmid": "446031679",
            "subject": "Точилки для ножей",
            "category": "",
            "category_pnl": null,
            "brand": "soultech",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "fort-kor",
            "plan_sum": 0,
            "nmid": "472726120",
            "subject": "Сумки",
            "category": null,
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Avenger2816",
            "plan_sum": 0,
            "nmid": "507171983",
            "subject": "Аксессуары для квадрокоптеров",
            "category": null,
            "category_pnl": null,
            "brand": "",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "baget-white",
            "plan_sum": 0,
            "nmid": "164417381",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Sumclassicblackky",
            "plan_sum": 0,
            "nmid": "116384988",
            "subject": "Сумки",
            "category": "",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Sumclassicbrownyy",
            "plan_sum": 0,
            "nmid": "116384989",
            "subject": "Сумки",
            "category": "",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Sumclassicwhiteys",
            "plan_sum": 0,
            "nmid": "116384990",
            "subject": "Сумки",
            "category": "",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "SumkaMidbeigemid",
            "plan_sum": 0,
            "nmid": "116387807",
            "subject": "Сумки",
            "category": "",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "SumkaMidblackmid",
            "plan_sum": 0,
            "nmid": "116387808",
            "subject": "Сумки",
            "category": "",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "SumkaMidbrownmid",
            "plan_sum": 0,
            "nmid": "116387809",
            "subject": "Сумки",
            "category": "",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Brown-Basketball",
            "plan_sum": 0,
            "nmid": "155863836",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Pink-Basketball",
            "plan_sum": 0,
            "nmid": "155863837",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "black-kosuha",
            "plan_sum": 0,
            "nmid": "156186790",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "kosh-gologr",
            "plan_sum": 0,
            "nmid": "156200053",
            "subject": "Кредитницы",
            "category": "",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Rukzak-shen1",
            "plan_sum": 0,
            "nmid": "163001095",
            "subject": "Рюкзаки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "fort-black",
            "plan_sum": 0,
            "nmid": "177939180",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "baget-brown",
            "plan_sum": 0,
            "nmid": "164417383",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "baget-black",
            "plan_sum": 0,
            "nmid": "164417549",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Black-Basketball",
            "plan_sum": 0,
            "nmid": "164645751",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "White-Basketball",
            "plan_sum": 0,
            "nmid": "164645752",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "Black-football",
            "plan_sum": 0,
            "nmid": "164646199",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "white-small",
            "plan_sum": 0,
            "nmid": "164659543",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "black-small",
            "plan_sum": 0,
            "nmid": "164659545",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "pink-small",
            "plan_sum": 0,
            "nmid": "164659548",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "mol-white",
            "plan_sum": 0,
            "nmid": "177829218",
            "subject": "Сумки",
            "category": "",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        },
        {
            "isChecked": 0,
            "SKU": "mol-pink",
            "plan_sum": 0,
            "nmid": "177829893",
            "subject": "Сумки",
            "category": "Аксессуары",
            "category_pnl": null,
            "brand": "YourMadMood",
            "status_name": null
        }
    ]
}

export const UPSERT_PLAN_FACT_RESPONSE_MOCK: IBaseResponseData =  
  {
    "is_error": 0,
    "msg": "Успешно сохранено"
  }

export const DELETE_PLAN_FACT_RESPONSE_MOCK: IBaseResponseData =  
  {
    "is_error": 0,
    "msg": "Объект удален"
  }

export const CLONE_PLAN_FACT_RESPONSE_MOCK: IBaseResponseData =  
  {
    "is_error": 0,
    "msg": "Успешно сохранено"
  }