import { IPNLGridData } from "./pnl.model";

export const PNL_GRID_DATA: IPNLGridData = {
  "data": [
    {
      "data": {
        "name": "Выручка",
        "item_id": 1,
        "total": 14662893.56,
        "2025-12": 14662893.56,
        "2026-01": ""
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "Продажи в ценах поставщика с самовыкупами",
            "item_id": 1000,
            "2025-12": 14651933.875610352,
            "total": 14651933.88
          }
        },
        {
          "data": {
            "name": "Продажи в ценах поставщика без самовыкупов",
            "item_id": 1001,
            "2025-12": 14651933.875610352,
            "total": 14651933.88
          }
        },
        {
          "data": {
            "name": "Продажи в ценах WB с самовыкупами",
            "item_id": 1002,
            "2025-12": 11588507.395843506,
            "total": 11588507.4
          }
        },
        {
          "data": {
            "name": "Продажи в ценах WB без самовыкупов",
            "item_id": 1003,
            "2025-12": 11588507.395843506,
            "total": 11588507.4
          }
        },
        {
          "data": {
            "name": "СПП",
            "item_id": 1064,
            "2025-12": 3063426.4797668457,
            "total": 3063426.48
          }
        },
        {
          "data": {
            "name": "Самовыкупы - сумма в платеже",
            "item_id": 1004,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Прочие доплаты",
            "item_id": 1085,
            "2025-12": 10959.68002319336,
            "total": 10959.68
          }
        }
      ]
    },
    {
      "data": {
        "name": "Переменные затраты (прямые)",
        "item_id": 10,
        "total": 9880091.11,
        "2025-12": 9880091.11,
        "2026-01": ""
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "Комиссия ВБ",
            "item_id": 1005,
            "2025-12": 4951193.215796709,
            "total": 4951193.22
          }
        },
        {
          "data": {
            "name": "Комиссия ВБ, %",
            "item_id": 1070,
            "2025-12": "33,79 %"
          }
        },
        {
          "data": {
            "name": "Логистика ВБ",
            "item_id": 1006,
            "2025-12": 1238289.9662380219,
            "total": 1238289.97
          }
        },
        {
          "data": {
            "name": "Логистика ВБ, %",
            "item_id": 1072,
            "2025-12": "8,45 %"
          }
        },
        {
          "data": {
            "name": "Себестоимость товара, руб (вносится на листе Себестоимость)",
            "item_id": 1007,
            "2025-12": 3690607.933526993,
            "total": 3690607.93
          }
        },
        {
          "data": {
            "name": "Себестоимость товара ВБ, %",
            "item_id": 1074,
            "2025-12": "25,19 %"
          }
        },
        {
          "data": {
            "name": "Закупка, руб",
            "item_id": 1089,
            "2025-12": 3276769.566192627,
            "total": 3276769.57
          }
        },
        {
          "data": {
            "name": "Закупка, %",
            "item_id": 1090,
            "2025-12": "22,36 %"
          }
        },
        {
          "data": {
            "name": "Доп. расходы, руб",
            "item_id": 1091,
            "2025-12": 413838.36733436584,
            "total": 413838.37
          }
        },
        {
          "data": {
            "name": "Доп. расходы, %",
            "item_id": 1092,
            "2025-12": "2,82 %"
          }
        },
        {
          "data": {
            "name": "Test Eyyup 12:04",
            "item_id": 509,
            "total": ""
          }
        }
      ]
    },
    {
      "data": {
        "name": "Маржинальная прибыль",
        "item_id": 50,
        "total": 4782802.45,
        "2025-12": 4782802.45,
        "2026-01": ""
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "Маржинальная прибыль (средняя)",
            "item_id": 1012,
            "total": "",
            "2025-12": "32,62 %",
            "2026-01": ""
          }
        }
      ]
    },
    {
      "data": {
        "name": "Постоянные затраты (прямые)",
        "item_id": 11,
        "total": 351613.46,
        "2025-12": 351613.46,
        "2026-01": ""
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "Внутренняя реклама (API РК Финансы - по факту начисления рекламы, а не списания в удержаниях)",
            "item_id": 1061,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Реклама по удержаниям",
            "item_id": 1081,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Услуга «ВБ.Медиа»",
            "item_id": 1095,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "ДРР, %",
            "item_id": 1086,
            "2025-12": "0,00 %"
          }
        },
        {
          "data": {
            "name": "Услуга «Джем»",
            "item_id": 1096,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Витрина Магазина",
            "item_id": 1101,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Реклама в ПВЗ",
            "item_id": 1102,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Доплаты",
            "item_id": 1062,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Штрафы",
            "item_id": 1063,
            "2025-12": 3260.60009765625,
            "total": 3260.6
          }
        },
        {
          "data": {
            "name": "Оплата эквайринга",
            "item_id": 1075,
            "2025-12": 281675.1998221874,
            "total": 281675.2
          }
        },
        {
          "data": {
            "name": "Хранение",
            "item_id": 1079,
            "2025-12": 66677.66001999378,
            "total": 66677.66
          }
        },
        {
          "data": {
            "name": "Платная приемка",
            "item_id": 1080,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Платная приемка по FBO",
            "item_id": 1099,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Платная приемка по FBS",
            "item_id": 1100,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Прочие удержания/выплаты",
            "item_id": 1082,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Фулфилмент вне с/с",
            "item_id": 107,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Реклама таргет / блогеры",
            "item_id": 111,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Кэшбек за отзывы",
            "item_id": 113,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Упаковка и расходные материалы вне с/с",
            "item_id": 193,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Самовыкупы - Доп. расходы по самовыкупам",
            "item_id": 1034,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Самовыкупы - Подрядчик по выкупам",
            "item_id": 1039,
            "2025-12": 0,
            "total": ""
          }
        }
      ]
    },
    {
      "data": {
        "name": "Валовый доход",
        "item_id": 51,
        "total": 4431188.99,
        "2025-12": 4431188.99,
        "2026-01": ""
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "Валовый доход (средняя)",
            "item_id": 1040,
            "total": "",
            "2025-12": "30,22 %",
            "2026-01": ""
          }
        }
      ]
    },
    {
      "data": {
        "name": "Постоянные затраты (косвенные)",
        "item_id": 12,
        "total": "",
        "2025-12": "",
        "2026-01": ""
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "Дизайнеры / Фотографы",
            "item_id": 110,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Расчетно-кассовое обслуживание (РКО)",
            "item_id": 115,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Софт, сервисы",
            "item_id": 116,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Сертификация и регистрация торговых марок",
            "item_id": 117,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Аренда и коммунальные платежи",
            "item_id": 118,
            "total": ""
          }
        },
        {
          "data": {
            "name": "ЗП (зарплата)",
            "item_id": 120,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Обучение",
            "item_id": 121,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Оборудование менее 40т.руб.",
            "item_id": 123,
            "total": ""
          }
        }
      ]
    },
    {
      "data": {
        "name": "Операционная прибыль",
        "item_id": 52,
        "total": 4431188.99,
        "2025-12": 4431188.99,
        "2026-01": ""
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "Операционная прибыль (средняя)",
            "item_id": 1050,
            "total": "",
            "2025-12": "30,22 %",
            "2026-01": ""
          }
        }
      ]
    },
    {
      "data": {
        "name": "Доходы внереализационные",
        "item_id": 56,
        "total": "",
        "2025-12": "",
        "2026-01": ""
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "Кэшбэк от банка",
            "item_id": 103,
            "total": ""
          }
        }
      ]
    },
    {
      "data": {
        "name": "Расходы внереализационные",
        "item_id": 57,
        "total": "",
        "2025-12": null,
        "2026-01": null
      },
      "expanded": false
    },
    {
      "data": {
        "name": "Прибыль до вычета налогов, процентов и амортизации (EBITDA)",
        "item_id": 54,
        "total": 4431188.99,
        "2025-12": 4431188.99,
        "2026-01": ""
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "EBITDA (средняя)",
            "item_id": 1051,
            "total": "",
            "2025-12": "30,22 %",
            "2026-01": ""
          }
        }
      ]
    },
    {
      "data": {
        "name": "Доходы ниже EBITDA",
        "item_id": 13,
        "total": "",
        "2025-12": null,
        "2026-01": null
      },
      "expanded": false
    },
    {
      "data": {
        "name": "Расходы ниже EBITDA",
        "item_id": 14,
        "total": 875431.48,
        "2025-12": 875431.48,
        "2026-01": ""
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "Налоги",
            "item_id": 1060,
            "2025-12": 218857.86935597594,
            "total": 218857.87
          }
        },
        {
          "data": {
            "name": "НДС",
            "item_id": 1087,
            "2025-12": 656573.6080679233,
            "total": 656573.61
          }
        },
        {
          "data": {
            "name": "Кредит ВБ (Выплата процентов)",
            "item_id": 1098,
            "2025-12": 0,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Займ / кредит (Выплата процентов)",
            "item_id": 136,
            "total": ""
          }
        },
        {
          "data": {
            "name": "Инвесторы (Выплата процентов)",
            "item_id": 138,
            "total": ""
          }
        },
        {
          "data": {
            "name": "НДС для ОПиУ",
            "item_id": 905,
            "total": ""
          }
        }
      ]
    },
    {
      "data": {
        "name": "Чистая прибыль ИТОГ",
        "item_id": 55,
        "total": 3555757.51,
        "2025-12": 3555757.51,
        "2026-01": ""
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "Рентабельность по чистой прибыли ",
            "item_id": 1055,
            "total": "",
            "2025-12": "24,25 %",
            "2026-01": ""
          }
        },
        {
          "data": {
            "name": "Дивиденды собственнику",
            "item_id": 119,
            "total": ""
          }
        }
      ]
    },
    {
      "data": {
        "name": "Нераспределенная прибыль",
        "item_id": 1057,
        "total": 3555757.51,
        "2025-12": 3555757.51,
        "2026-01": "0.00"
      },
      "expanded": false,
      "children": [
        {
          "data": {
            "name": "Прибыль накопленным итогом",
            "item_id": 1058,
            "total": "",
            "2025-12": 3555757.51,
            "2026-01": 3555757.51
          }
        },
        {
          "data": {
            "name": "ROI",
            "item_id": 1059,
            "2025-12": "31,91 %",
            "2026-01": ""
          }
        }
      ]
    }
  ],
  "columns": [
    {
      "field": "total",
      "header": "Итого"
    },
    {
      "field": "2025-12",
      "header": "12.2025"
    },
    {
      "field": "2026-01",
      "header": "01.2026"
    }
  ]
}